OpenFOAM/foam9tutorials/tutorials/multiphase/interFoam/RAS/propeller/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh if necessary
if ! cloneMesh ../../../incompressible/pimpleFoam/RAS/propeller .
then
    ./Allmesh
fi

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
